  [
    {
    "name": "He's Alright",
    "joke": "Did you hear about the guy whose whole left side was cut off? He's all right now."
  },
  {
    "name": "pirate's favorite letter",
    "joke": "What's a pirate's favorite letter? It be the Sea"
  },
  {
    "name": "counting cows",
    "joke": "How do you count cows? A 'Cow'culator"
  },
  {
    "name": "Nut Assault",
    "joke": "Two peanuts were walking down the street. One was a salted."
  },
  {
    "name": "Wonderwall",
    "joke": "My son asked me to stop singing Oasis songs in public. I said maybe."
  },
  {
    "name": "Banking",
    "joke": "I used to be a banker but I lost interest"
  },
  {
    "name": "Bakery Fire",
    "joke": "My friend's bakery burned down last night. Now his business is toast."
  },
  {
    "name": "Golfer Pants",
    "joke": "Why did the golfer bring two pairs of pants? In case he got a hole-in-one."
  },
  {
    "name": "Bel Air",
    "joke": "How do you find Will Smith in the snow? You look for the fresh prints."
  },
  {
    "name": "Exhaust",
    "joke": "I had a dream that I was a muffler last night. I woke up exhausted."
  },
  {
    "name": "Sandwich",
    "joke": "A ham sandwich walks into a bar and orders a beer. The bartender looks at him and says, ‘Sorry we don’t serve food here."
  },
  {
    "name": "Thing Factory",
    "joke": "Where are average things built? In the satisfactory."
  },
  {
    "name": "Thoughtful Clown",
    "joke": "Yesterday a clown held a door open for me. I thought it was a nice jester."
  },
  {
    "name": "24 Hours",
    "joke": "Astronomers got tired of watching the moon go round the earth for 24 hours, so they decided to call it a day."
  },
  {
    "name": "Checkout Girl",
    "joke": "I asked the checkout girl for a date. She said \"They're in the fruit aisle next to the bananas.\""
  },
  {
    "name": "Well Dressed Bicycle",
    "joke": "What's the difference between a well dressed man on a a bicycle and a poorly dressed man on a tricycle? Attire!"
  },
  {
    "name": "Every 6 Months",
    "joke": "What time did the man go to the dentist? Tooth hurt-y."
  },
  {
    "name": "Tropical Diet",
    "joke": "My wife is on a tropical food diet, the house is full of the stuff. It's enough to make a mango crazy."
  },
  {
    "name": "Whiteboards",
    "joke": "Whiteboards are remarkable."
  },
  {
    "name": "Italians",
    "joke": "What do you call a sketchy Italian neighbourhood? The Spaghetto."
  },
  {
    "name": "Terror Of The Skies",
    "joke": "What has twenty legs and flies? Ten pairs of pants."
  },
  {
    "name": "Pirate Birthday",
    "joke": "What did the pirate say on his 80th birthday? Aye matey"
  },
  {
    "name": "Kleptomania",
    "joke": "I have kleptomania, but when it gets bad, I take something for it."
  },
  {
    "name": "Eye Love This Joke",
    "joke": "What do you call a fish with no eyes? Fsh."
  },
  {
    "name": "The Royal Flush Of The Jungle",
    "joke": "Why shouldn't you play cards in the jungle? Too many cheetahs."
  },
  {
    "name": "Meling",
    "joke": "What do you call a man with a rug on his head? Matt."
  },
  {
    "name": "A Toast To Monkey Jokes",
    "joke": "How do you make toast in the jungle? Pop your bread under a g'rilla."
  },
  {
    "name": "Wanted For Eight Armed Robbery",
    "joke": "Who is the quickest draw in the ocean? Billy the Squid."
  },
  {
    "name": "My Nephew",
    "joke": "What's brown and sticky? A stick."
  },
  {
    "name": "Prison Jewelry",
    "joke": "What's the difference between a jeweller and a prison warden? One sells watches, and the other watches cells."
  },
  {
    "name": "Why Don't They Just Open A Bankery",
    "joke": "Why do bakers work so hard? They knead the dough."
  },
  {
    "name": "Banana Joke For Scale",
    "joke": "Why did the banana go to the doctors'? He wasn't peeling very well."
  },
  {
    "name": "Burglars",
    "joke": "How does a burglar get into your house? Intruder window."
  },
  {
    "name": "Do Androids Dream of Electric Clouds?",
    "joke": "What do you call a sheep with no legs? A cloud."
  },
  {
    "name": "Your Grapes Take My Breath Away",
    "joke": "What did the green grape say to the purple grape? Breathe, you fool, breathe!"
  },
  {
    "name": "This Piano Jokes Struck A Chord",
    "joke": "What do you get if you drop a piano down a coal shaft? A flat minor."
  },
  {
    "name": "Soul Duck",
    "joke": "How do you turn a duck into a soul singer? Put it in a microwave until its bill withers."
  },
  {
    "name": "If You Count Alcoholics As Wealth",
    "joke": "What is the richest country in the world? Ireland. Its capital is always Dublin."
  },
  {
    "name": "A Wall Of movies",
    "joke": "Last night me and my girlfriend watched three movies back to back. Luckily I was the one facing the TV."
  },
  {
    "name": "De-Grubered",
    "joke": "I've deleted the phone numbers of all the Germans I know from my mobile phone. Now it's Hans free."
  },
  {
    "name": "You Can't Handle The Ending",
    "joke": "Why did the octopus beat the shark in a fight? Because it was well armed."
  },
  {
    "name": "The Dream Was Deep In Soda Me",
    "joke": "I dreamed about drowning in an ocean made out of orange soda last night. It took me a while to work out it was just a Fanta sea."
  },
  {
    "name": "You Have To Be Kitten Me",
    "joke": "My cat just threw up on the carpet. I don't think it's feline well."
  },
  {
    "name": "They Pinch Pennies",
    "joke": "Why do crabs never give to charity? Because they're shellfish."
  },
  {
    "name": "Czech This Joke Out",
    "joke": "I was thinking about moving to Moscow but there is no point Russian into things."
  },
  {
    "name": "They Only Serve Cheese",
    "joke": "Did you hear about the new restaurant on the moon? The food is great, but there's just no atmosphere."
  },
  {
    "name": "Clean Vocals",
    "joke": "Singing in the shower is all fun and games until you get shampoo in your mouth. Then it's a soap opera."
  },
  {
    "name": "Not Even A Tinkle",
    "joke": "Why can't you hear a pterodactyl using the bathroom? Because the P is silent."
  },
  {
    "name": "I Predict A Heart Attack",
    "joke": "What do you call a fat psychic? A four-chin teller."
  },
  {
    "name": "This Joke Will Spark A Laugh",
    "joke": "What's the difference between a hippo and a Zippo? One is heavy, and the other is a little lighter."
  },
  {
    "name": "Uno Joke, Por Favor",
    "joke": "A Mexican magician says he'll disappear on the count of 3; \"Uno... dos... poof...\". He disappeared without a tres."
  },
  {
    "name": "Tasteless Joke",
    "joke": "Today a girl said she recognized me from vegetarian club, but I'm sure I've never met herbivore."
  },
  {
    "name": "A gigabyte",
    "joke": "You heard of that new band 1023MB? They're good but they haven't got a gig yet."
  },
  {
    "name": "Book on anti-gravity",
    "joke": "I'm reading a book about anti-gravity. It's impossible to put down!"
  },
  {
    "name": "Greece Fries",
    "joke": "Did you know the first French fries weren't actually cooked in France? They were cooked in Greece."
  },
  {
    "name": "Piece of paper",
    "joke": "Want to hear a joke about a piece of paper? Never mind... it's tearable."
  },
  {
    "name": "Beaver Show",
    "joke": "I just watched a documentary about beavers. It was the best dam show I ever saw!"
  },
  {
    "name": "Fake Pasta",
    "joke": "What do you call a fake noodle? An Impasta."
  },
  {
    "name": "Lost Car",
    "joke": "What do you call a Mexican who has lost his car? Carlos."
  },
  {
    "name": "Scarecrow outstanding",
    "joke": "Why did the scarecrow win an award? Because he was outstanding in his field."
  },
  {
    "name": "Standing Bicycle",
    "joke": "Why couldn't the bicycle stand up by itself? It was two tired."
  },
  {
    "name": "Joke about coke",
    "joke": "I got hit in the head with a can of Diet Coke today. Don't worry, I'm not hurt. It was a soft drink"
  },
  {
    "name": "Tickle an octopus",
    "joke": "How do you make an octopus laugh? With ten-tickles"
  },
  {
    "name": "Best way to watch fishing",
    "joke": "What's the best way to watch a fly fishing tournament? Live stream"
  },
  {
    "name": "Vampire Shopping",
    "joke": "Where did the college-aged vampire like to shop? Forever 21."
  },
  {
    "name": "Buffalo's first day",
    "joke": "What did the buffalo say to his son when he dropped him off at school? Bison"
  },
  {
    "name": "Vampire Snowman",
    "joke": "What do you get when you cross a snowman with a vampire? Frostbite."
  },
  {
    "name": "Dad's weight",
    "joke": "SERVER: \"Sorry about your wait.\" DAD: \"Are you saying I’m fat?"
  },
  {
    "name": "Popcorn Family",
    "joke": "What did the baby corn say to the mama corn?Where's pop corn?"
  },
  {
    "name": "Computer Sings",
    "joke": "What computer sings the best? A Dell."
  },
  {
    "name": "Peter pan",
    "joke": "Why is Peter Pan always flying? Because he neverlands."
  },
  {
    "name": "Samsung Guards",
    "joke": "What do you call security guards working outside Samsung shops? Guardians of the Galaxy."
  },
  {
    "name": "Jay-z Fiance",
    "joke": "What did Jay-Z call his girlfriend before getting married? Feyoncè."
  },
  {
    "name": "Wake up lady gaga",
    "joke": "How do you wake up Lady Gaga? Poker face"
  },
  {
    "name": "Koala Job Applicatoin",
    "joke": "Why aren’t koalas actual bears? They don’t meet the koalafications."
  },
  {
    "name": "Panda Customer",
    "joke": "Who walks into a restaurant, eats shoots and leaves? A Panda "
  },
  {
    "name": "Nasa Party Planner",
    "joke": "How does NASA organize a party?\nThey planet"
  },
  {
    "name": "The Ball",
    "joke": "Where do hamburgers go to dance? They go to the meat-ball "
  },
  {
    "name": "Fisherman Magic",
    "joke": "What did the fisherman say to the magician? Pick a cod, any cod! "
  },
  {
    "name": "Lemon is sick",
    "joke": "What do you give to a sick lemon? Lemon aid! "
  },
  {
    "name": "Frog Drives",
    "joke": "Why did the frog take the bus to work? His car got toad. "
  },
  {
    "name": "Soda Crusher Quits",
    "joke": "Why did the can crusher quit his job? \nBecause it was soda pressing. "
  },
  {
    "name": "Sensitive Burglar",
    "joke": "Did you hear about the sensitive burglar? He takes things personally. "
  },
  {
    "name": "Prisoner Calls Prisoner",
    "joke": "What do prisoners use to call each other? Cell phones. "
  },
  {
    "name": "Computer Dance",
    "joke": "Where did the computer go to dance? To a disc-o "
  },
  {
    "name": "Funny Hill",
    "joke": " What do you call a funny mountain? Hill-arious! "
  },
  {
    "name": "Hannibal Soup",
    "joke": "What do you call a can of soup that eats other cans of soup? A CANnibal. "
  },
  {
    "name": "Butter Rumours",
    "joke": "You heard the rumor going around about butter? Never mind, I shouldn't spread it."
  },
  {
    "name": "House clothing",
    "joke": "What does a house wear? A-ddress. "
  },
  {
    "name": "MJ Denim Store",
    "joke": "What did Michael Jackson call his denim store? Billie Jeans"
  },
  {
    "name": "Ghost poop",
    "joke": "What do you call a ghost poop? Boo-boo"
  },
  {
    "name": "Toilet Paper Crossing",
    "joke": "Why couldn't the toilet paper cross the road? He got stuck on a crack"
  },
  {
    "name": "JaRule's Hit Contract",
    "joke": "What did Ja-Rule use to sign a hitman contract? Murder Ink"
  },
  {
    "name": "Spaghetti Movie",
    "joke": "If Spaghetti made an action movie, what would it be called? Mission Im-pasta-ble"
  },
  {
    "name": "Mermaid Wash",
    "joke": "What do mermaids use to wash their fins with? Tide"
  },
  {
    "name": "Blazer",
    "joke": "What do you call a jacket that goes up in flames? Blazer"
  },
  {
    "name": "Fun Guy",
    "joke": "What did the mushroom say to impress his date? I'm a FunGi"
  },
  {
    "name": "Dog watching videos",
    "joke": "How did the dog stop the video? It hit the paws button"
  },
  {
    "name": "Burger's Girlfriend",
    "joke": "How did the hamburger introduce his girlfriend? Meat Patty"
  },
  {
    "name": "Pixar Movies",
    "joke": "Rick Astley will let you borrow any of his Pixar Movies except for one, He's never gonna give you UP"
  },
  {
    "name": "Wrapper",
    "joke": "I wrote a song about Tortilla, it's more of a Wrap"
  },
  {
    "name": "Blind Man Walking",
    "joke": "Why did the blind man fall into the well? He didn't see that well"
  },
  {
    "name": "No leg cow",
    "joke": "What do you call a cow without legs? Ground beef"
  },
  {
    "name": "Weak Days",
    "joke": "What are the strongest days of the week? Saturday & Sunday, the rest are weak days"
  }
]